; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v2)
		(pred_2 ?v1)
		(pred_1 ?v7)
		(pred_4 ?v7)
		(pred_3 ?v1 ?v7)
		(pred_5)
		(pred_6 ?v1))

   (:action op_3
       :parameters  (?v4 ?v3)
       :precondition (and (not-eq ?v4 ?v3) 
                          (pred_1 ?v4) (pred_1 ?v3) (pred_4 ?v4))
       :effect (and  (pred_4 ?v3)
		     (not (pred_4 ?v4))))


   (:action op_1
       :parameters (?v8 ?v5)
       :precondition  (and  (pred_2 ?v8) (pred_1 ?v5)
			    (pred_3 ?v8 ?v5) (pred_4 ?v5) (pred_5))
       :effect (and (pred_6 ?v8)
		    (not (pred_3 ?v8 ?v5)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v8  ?v5)
       :precondition  (and  (pred_2 ?v8) (pred_1 ?v5)
			    (pred_6 ?v8) (pred_4 ?v5))
       :effect (and (pred_3 ?v8 ?v5)
		    (pred_5)
		    (not (pred_6 ?v8)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_05 
          obj_03 obj_04 obj_02 
)
(:init
(pred_1 obj_06)
(pred_1 obj_01)
(pred_1 obj_05)
(pred_2 obj_03)
(pred_2 obj_04)
(pred_2 obj_02)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_5)
(pred_3 obj_03 obj_06)
(pred_3 obj_04 obj_06)
(pred_3 obj_02 obj_01)
(pred_4 obj_01)
)
(:goal
(and
(pred_3 obj_03 obj_06)
(pred_3 obj_04 obj_01)
(pred_3 obj_02 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_04 obj_01) (pred_4 obj_05))
    (sometime-before  (pred_3 obj_02 obj_06) (pred_4 obj_05))
  )
)
)

; plan
1. (op_1 obj_02 obj_01)
   deleted: (pred_3 obj_02 obj_01) (pred_5)
   added: (pred_6 obj_02)
   goals met: 1 of 3
2. (op_3 obj_01 obj_05)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_05)
   goals met: 1 of 3
3. (op_2 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_05) (pred_5)
   goals met: 1 of 3
4. (op_3 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 1 of 3
5. (op_1 obj_04 obj_06)
   deleted: (pred_3 obj_04 obj_06) (pred_5)
   added: (pred_6 obj_04)
   goals met: 1 of 3
6. (op_3 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_01)
   goals met: 1 of 3
7. (op_2 obj_04 obj_01)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_01) (pred_5)
   goals met: 2 of 3
8. (op_3 obj_01 obj_05)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_05)
   goals met: 2 of 3
9. (op_1 obj_02 obj_05)
   deleted: (pred_3 obj_02 obj_05) (pred_5)
   added: (pred_6 obj_02)
   goals met: 2 of 3
10. (op_3 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 2 of 3
11. (op_2 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_06) (pred_5)
   goals met: 3 of 3
